#+TITLE: Study: Access Control Lists reasoning for updates

** Applicable vectors per type
   Discovering the type verifications that need to be calculated for
   each triple is now handled by executing an AND between these two
   vectors (such as =bit-and=).

   With this in place we would calculate the type vector as:

   #+name: bit-vector
   #+begin_src lisp :cache yes
     (bit-and #*00001000000111111 #*10001010010010100)
   #+end_src

   #+RESULTS[d7794378a470c9c9bb6922400699f932dfaf81ac]: bit-vector
   : #*00001000000010100

